app/controllers/form_controller.rb

  def index
    @all_form = Form.all
---
SELECT "forms".* FROM "forms"

  def show
    @show_form = Form.find(params[:show_id])
---
SELECT  "forms".* FROM "forms" WHERE "forms"."id" = ? LIMIT 1  [["id", 1]]

  def create
    new_table =  Form.new(title: params[:title], editor: params[:editor], content: params[:content])
    new_table.save
---
INSERT INTO "forms" ("title", "editor", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ㅇㅏ아"], ["editor", "민호"], ["content", "ㅇ아아아\r\n"], ["created_at", "2018-05-23 02:31:50.160664"], ["updated_at", "2018-05-23 02:31:50.160664"]]