app/controllers/posts_controller.rb

  def index
    @all_form = Post.all
---
SELECT "posts".* FROM "posts"

  def show
    @show_form = Post.find(params[:show_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

  def create
    new_table =  Post.new(title: params[:title], editor: params[:editor], content: params[:content])
    new_table.save
---
INSERT INTO "posts" ("title", "editor", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "dd"], ["editor", "민호"], ["content", "dd"], ["created_at", "2018-05-25 19:24:36.625488"], ["updated_at", "2018-05-25 19:24:36.625488"]]