app/controllers/reply_controller.rb

INSERT INTO "replies" ("editor", "content", "Post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["editor", "ffff"], ["content", "ffff"], ["Post_id", 1], ["created_at", "2018-05-25 19:30:05.635593"], ["updated_at", "2018-05-25 19:30:05.635593"]]
---
  def create
    new_reply = Reply.new
    new_reply.editor = params[:editor]
    new_reply.content = params[:content]
    new_reply.Post_id = params[:p_id]
    new_reply.save

DELETE FROM "replies" WHERE "replies"."id" = ?  [["id", 1]]
SELECT  "replies".* FROM "replies" WHERE "replies"."id" = ? LIMIT 1  [["id", 1]]
---
  def destroy
    Reply.find(params[:d_id]).destroy